{"intents": [
        {"tag": "genericResponsePositive",
         "patterns": [
            "I'm pretty sure I got it right!",
            "I feel confident about my answer.",
            "I think I got it right!",
            "I'm feeling good about my answer!",
            "I'm feeling positive and optimistic about my answer!",
            "I'm confident that I gave it my best shot!",
            "I'm feeling proud of my answer!",
            "I believe I got it right!",
            "I'm feeling happy about my answer!"
          ],
         "responses": [
            "Great job! You really know your stuff!",
            "I can tell you put a lot of thought into your answer. Keep up the good work!",
            "Excellent work! I'm impressed with your confidence!",
            "You're doing a fantastic job!",
            "Your positive attitude is really paying off. Keep it up!",
            "You should be proud of yourself. You're doing great!",
            "I'm so impressed with your progress. Keep up the good work!",
            "You're doing an awesome job! Keep it up!",
            "I can tell you're really putting in the effort. Great work!",
            "You're on the right track. Keep up the good work!"
          ],
         "context_set": ""
        },
        {"tag": "genericResponseNegative",
         "patterns": [
            "I'm not sure if I got it right.",
            "I don't feel very confident about my answer.",
            "I'm not sure if I understand it well enough.",
            "I'm not feeling very certain about my answer.",
            "I think I might have made a mistake.",
            "I'm not sure if I'm on the right track.",
            "I'm not very confident about my response.",
            "I'm not sure if I understood the question correctly.",
            "I'm not feeling very sure about my understanding.",
            "I think I might need some more help with this."
          ],
         "responses": [
            "That's okay, let's take a closer look together.",
            "That's alright, let's work through it step by step.",
            "It's okay to make mistakes, that's how we learn.",
            "Don't worry, we can review and try again.",
            "That's alright, let's try another approach.",
            "It's okay to not understand everything right away.",
            "That's alright, let's take a break and come back to it later.",
            "That's okay, let's keep working on it until you feel more confident.",
            "It's okay to ask questions if you're not sure.",
            "Don't worry, we can go over it again until you feel comfortable."
          ],
         "context_set": ""
        },
        {"tag": "numberAndPlaceValuePositive",
         "patterns": [
            "I'm feeling pretty good about my understanding of place value!",
            "I'm confident that I understand the difference between ones, tens, and hundreds.",
            "I think I've got a good handle on place value!",
            "I'm feeling confident about my understanding of number lines.",
            "I'm feeling positive about my ability to compare and order numbers.",
            "I'm confident that I know how to round numbers to the nearest 10 and 100.",
            "I'm feeling pretty confident about my understanding of number patterns.",
            "I'm feeling good about my ability to count in different ways.",
            "I'm feeling confident about my understanding of odd and even numbers.",
            "I'm feeling positive about my understanding of place value columns."
          ],
         "responses": [
            "Great job! It sounds like you really understand place value.",
            "I'm impressed with your understanding of number lines. Keep up the good work!",
            "You're doing an excellent job with Number and Place Value!",
            "That's fantastic! You really know your stuff when it comes to rounding numbers.",
            "I'm glad to hear that you're feeling positive about your ability to compare and order numbers.",
            "Keep up the great work! It's clear that you have a solid understanding of number patterns.",
            "Excellent job! You're doing a great job with counting in different ways.",
            "I'm proud of you for understanding odd and even numbers. Keep up the good work!",
            "You're really grasping the concept of place value columns. I'm impressed!",
            "You're doing a great job overall in Number and Place Value. Keep it up!"
          ],
         "context_set": ""
        },
        {"tag": "numberAndPlaceValueNegative",
         "patterns": [
            "I don't really understand the concept.",
            "I'm not sure how to do it.",
            "It's too hard for me to figure out.",
            "I don't know where to start.",
            "I'm confused about what to do.",
            "I'm not confident with my understanding of this topic.",
            "I feel like I'm guessing more than actually understanding.",
            "I'm having trouble keeping track of all the numbers.",
            "I'm not sure if I'm doing it correctly.",
            "I'm finding it difficult to see the patterns and relationships.",
            "I'm struggling to apply what I've learned to different situations.",
            "I don't feel comfortable with the vocabulary and terms used.",
            "I don't feel like I'm making progress with this topic.",
            "I'm not sure if my answer is accurate.",
            "I don't feel confident about using these concepts in real life."
          ],
         "responses": [
            "Let's start by reviewing the basics.",
            "It's okay to not understand everything at first, we'll work on it together.",
            "Let's break it down into smaller steps.",
            "Let's practice a few more examples to help build your understanding.",
            "Don't worry, we'll keep working on it until it makes sense.",
            "Let's go back to earlier lessons and review those topics before moving on.",
            "Remember, making mistakes is a natural part of learning.",
            "Let's try some different strategies to see what works best for you.",
            "Let's work on building your confidence through practice and review.",
            "It's okay to take your time and ask questions when you're unsure.",
            "Let's try a different approach to see if that helps.",
            "Don't be afraid to ask for help when you need it.",
            "Let's try to connect this topic to something you're interested in.",
            "We'll keep practicing until you feel more confident with this concept.",
            "Remember, it's okay to make mistakes as long as we learn from them.",
            "Let's work together to find resources that can help reinforce your understanding."
          ],
         "context_set": ""
        },
        {"tag": "additionAndSubtractionPositive",
         "patterns": [
            "I'm confident that I added/subtracted correctly!",
            "I feel good about my answer, I used the right method for adding/subtracting!",
            "I'm pretty sure I got the correct sum/difference!",
            "I'm confident in my ability to add/subtract single-digit numbers!",
            "I know I used the correct operation to solve the problem!",
            "I'm feeling pretty confident with my addition/subtraction skills!",
            "I feel like I understand the concepts of addition/subtraction well!",
            "I'm pretty happy with how I solved the problem!",
            "I feel confident in my ability to carry/borrow when adding/subtracting!",
            "I'm confident that I correctly regrouped the numbers when adding/subtracting!",
            "I'm confident that I correctly followed the order of operations when adding/subtracting!"
          ],
         "responses": [
            "Great job! You correctly added/subtracted the numbers!",
            "Well done! You used the correct method for adding/subtracting!",
            "Excellent work! You got the right sum/difference!",
            "Fantastic job! You showed great understanding of addition/subtraction concepts!",
            "Awesome! You used the correct operation to solve the problem!",
            "Very good! You demonstrated mastery of addition/subtraction of single-digit numbers!",
            "Impressive! You showed great confidence in your addition/subtraction skills!",
            "Superb work! You correctly carried/borrowed when adding/subtracting!",
            "You're a pro at regrouping numbers when adding/subtracting!",
            "Excellent! You followed the order of operations correctly when adding/subtracting!"
          ],
         "context_set": ""
        },
        {"tag": "additionAndSubtractionNegative",
         "patterns": [
            "I'm not sure if I carried the numbers correctly in my addition.",
            "I think I might have missed a number when subtracting.",
            "I don't think I added/subtracted the right digits in each place value.",
            "I'm not confident in my ability to regroup/borrow when adding/subtracting.",
            "I'm not sure if I properly lined up the numbers to add/subtract.",
            "I'm not sure if I remembered to carry over/borrow from the correct place value.",
            "I don't think I understand how to add/subtract multi-digit numbers.",
            "I think I need more practice with adding/subtracting larger numbers.",
            "I'm afraid I added/subtracted the wrong numbers together."
          ],
         "responses": [
            "It looks like you need to review your addition and subtraction skills.",
            "Let's work on taking our time and being more careful when adding and subtracting.",
            "You might want to revisit some of the basic addition and subtraction concepts to build your confidence.",
            "Remember to double check your work and look for errors when adding and subtracting.",
            "It's important to pay close attention to the numbers and place values when adding and subtracting.",
            "I can see that you're struggling with some of the addition and subtraction problems. Let's work on building those skills.",
            "We might need to take a step back and review some of the foundational concepts of addition and subtraction.",
            "Let's work on breaking down the addition and subtraction problems into smaller steps to make them more manageable.",
            "I'm concerned that you're rushing through the addition and subtraction problems and not taking your time.",
            "Remember to practice and work on your addition and subtraction skills to build your confidence."
          ],
         "context_set": ""
        },
        {"tag": "multiplicationAndDivisionPositive",
         "patterns": [
            "I feel really confident! I practiced a lot of multiplication and division problems.",  
            "I think I got it right this time! I remember the steps for multiplying and dividing.",  
            "I feel good about my answer because I double checked my work.", 
            "I'm pretty sure I got it. I know my times tables really well!",  
            "I feel confident because I understand the relationship between multiplication and division.",  
            "I feel good about my answer because I used a multiplication or division fact I already knew.",  
            "I think I understand this now! I can use multiplication or division to solve lots of different problems.",  
            "I feel confident because I used a strategy that my teacher taught me."
        ],
         "responses": [
            "Great job! You understand multiplication and division really well.",
            "You're really getting the hang of multiplication and division. Keep up the good work!",
            "Excellent work! You're making great progress in multiplication and division.",
            "You're doing a fantastic job with multiplication and division. Keep it up!",
            "Wow, you're really mastering multiplication and division. I'm impressed!",
            "Superb work! Your understanding of multiplication and division is really coming along.",
            "Great effort! Your hard work is paying off in your understanding of multiplication and division.",
            "Amazing work! Your grasp of multiplication and division is becoming really strong.",
            "Well done! Your understanding of multiplication and division is really improving.",
            "Fantastic work! Your confidence in multiplication and division is growing with every problem."
          ],
         "context_set": ""
        },
        {"tag": "multiplicationAndDivisionNegative",
         "patterns": [
            "I'm not sure about this multiplication/division problem.",
            "I'm not confident with the multiplication/division table.",
            "I'm not sure if I got the right answer for this multiplication/division problem.",
            "I find multiplication/division really hard.",
            "I think I messed up the multiplication/division calculation.",
            "I'm struggling with the multiplication/division concept.",
            "I don't understand how to solve this multiplication/division problem.",
            "I don't feel comfortable with multiplication/division at all.",
            "I don't think I can do multiplication/division very well."
          ],
         "responses": [
            "It seems like you might need to review your multiplication and division facts a bit more.",
            "Your answer is incorrect. Remember to double-check your work and practice your multiplication and division facts.",
            "You made a mistake with your multiplication or division. Let's work through it together.",
            "It's important to understand the relationship between multiplication and division. Let's review that concept together.",
            "I see that you're struggling with multiplication and division. Let's focus on practicing those skills more.",
            "Multiplication and division can be tricky, but with practice, you'll get there. Let's work through this problem together.",
            "It looks like you might need more practice with multiplication and division. Let's review those concepts together.",
            "Remember to pay close attention to the operation you need to use for each problem. Let's review that together for multiplication and division.",
            "Let's go through the steps for multiplication and division again to ensure you have a solid understanding of the process.",
            "Don't worry if you're struggling with multiplication and division, it can take time to master. Let's work on building your skills together."
          ],
         "context_set": ""
        },
        {"tag": "fractionsPositive",
         "patterns": [
            "I feel confident that I understand the concept of fractions.",
            "I think I can explain fractions to someone else.",
            "I understand how to find equivalent fractions.",
            "I feel good about adding and subtracting fractions.",
            "I know how to simplify fractions.",
            "I feel confident about comparing fractions.",
            "I understand how to convert between mixed numbers and improper fractions.",
            "I am confident about finding the least common denominator.",
            "I feel good about multiplying and dividing fractions.",
            "I understand how to use fractions in real-life situations."
          ],
         "responses": [
            "Great job! You really understand fractions.", 
            "You're doing really well with fractions. Keep up the good work!", 
            "Fantastic! You're really getting the hang of fractions.", 
            "Excellent work! Your understanding of fractions is really improving.", 
            "Wow, you're a fraction whiz! Keep up the good work.", 
            "Amazing job! You're making great progress with fractions.", 
            "You're doing a great job with fractions. Keep practicing and you'll get even better.",
            "Brilliant work! You have a really good understanding of fractions.", 
            "Super job! Your fractions skills are really impressive.", 
            "Outstanding work! You're really mastering fractions."
        ],
         "context_set": ""
        },
        {"tag": "fractionsNegative",
         "patterns": [
            "I don't really understand what a fraction is.",
            "I think I made a mistake, but I don't know where.",
            "I'm not sure what the question is asking me to do.",
            "I think I'm close, but I don't know how to check my answer.",
            "I don't know how to simplify the fraction.",
            "I don't know how to convert the fraction to a mixed number.",
            "I don't know how to convert the mixed number to a fraction.",
            "I don't understand the concept of equivalent fractions.",
            "I don't know how to compare fractions with different denominators.",
            "I don't know how to add or subtract fractions with different denominators.",
            "I don't know how to multiply or divide fractions.",
            "I'm not sure how to find the least common denominator.",
            "I don't know how to reduce the fraction to lowest terms.",
            "I'm not sure how to convert the improper fraction to a mixed number.",
            "I don't know how to find the fraction of a whole number."
          ],
         "responses": [
            "I think you need to review the concept of fractions before attempting this problem again.",
            "You might want to double-check your calculations for this fraction problem.",
            "Let's work together to identify where you may have gone wrong in your understanding of fractions.",
            "It looks like you need more practice with fractions before feeling confident in your answers.",
            "Your answer is incorrect. Take some time to review the concept of fractions and try again.",
            "Don't give up! Keep working on understanding the concept of fractions and you'll get it.",
            "I think you may have misunderstood the question. Let's review the concept of fractions together.",
            "Remember to always simplify your fractions to their lowest terms.",
            "You're on the right track, but you need to be more careful with your fraction calculations.",
            "It's important to remember the rules of fractions when adding, subtracting, multiplying, or dividing.",
            "Let's break down this fraction problem together to help you better understand the concept.",
            "I understand fractions can be challenging, but with practice and persistence, you'll get there.",
            "Let's review some examples of fraction problems together so you can gain a better understanding.",
            "Don't be discouraged by this mistake. Let's work together to find where you may have gone wrong.",
            "Remember to always check your work for errors when dealing with fractions."
          ],
         "context_set": ""
        },
        {"tag": "measurementPositive",
         "patterns": [
            "I'm really confident that I converted the units correctly.", 
            "I feel good about my answer because I used the right tools to measure.", 
            "I'm pretty sure I got the time right because I checked the clock.",
            "I'm confident that I can read an analog clock now.",
            "I feel confident that I used the correct formula to solve the problem.",
            "I'm confident that I correctly estimated the measurement.",
            "I think my answer is correct because I double-checked my calculations.",
            "I feel good about my answer because I used the appropriate units.",
            "I'm confident that I correctly measured the length, weight, and volume.",
            "I feel pretty confident that I can solve more difficult time problems now."
        ],
         "responses": [
            "Great job! Your understanding of measurement is really improving.",
            "Excellent work! You clearly have a strong grasp on telling the time.",
            "Wow, you're doing a fantastic job with measurement and telling time!",
            "I can see that you're working hard on your measurement and time-telling skills. Keep it up!",
            "You've clearly been practicing your measurement and time-telling, and it's paying off. Well done!",
            "I'm impressed by your progress in measurement and time-telling. Keep up the good work!",
            "You should be proud of yourself! Your measurement and time-telling skills are really coming along.",
            "Keep up the great work! Your ability to measure and tell time is getting better every day."
        ],
         "context_set": ""
        },
        {"tag": "measurementNegative",
         "patterns": [
            "I'm not sure how to measure this.",
            "I don't understand the units we're using.",
            "I can't remember which unit to use for this measurement.",
            "I don't know how to convert between different units.",
            "I'm having trouble reading the scale.",
            "I can't figure out how to calculate the elapsed time.",
            "I don't know how to read a clock with Roman numerals.",
            "I'm confused about the difference between AM and PM.",
            "I'm not sure how to use a 24-hour clock.",
            "I'm having trouble with time zones.",
            "I'm not confident with estimating time.",
            "I'm not sure how to calculate time differences."
          ],
         "responses": [
            "I'm afraid that's not quite right.",
            "Let's take another look at the problem together.",
            "Can you double-check your work?",
            "Remember to pay attention to the units you're using.",
            "It looks like you might have missed a step.",
            "We'll need to review this concept again.",
            "Are you sure you read the clock correctly?",
            "It's important to be precise when measuring.",
            "I think you might have made a calculation error.",
            "Let's practice this some more to build your confidence."
          ],
         "context_set": ""
        },
        {"tag": "propertiesOfShapesPositive",
         "patterns": [
            "I'm confident that I can identify different types of angles.",
            "I feel good about my ability to name different types of polygons.",
            "I know I can spot lines of symmetry in shapes.",
            "I'm sure that I can tell you the difference between a rhombus and a square.",
            "I'm feeling confident that I can identify different types of triangles.",
            "I'm positive that I can recognize parallel and perpendicular lines.",
            "I'm confident that I can calculate the perimeter and area of different shapes.",
            "I'm certain that I can classify shapes based on their properties.",
            "I know I can tell you whether a shape has rotational symmetry or not."
          ],
         "responses": [
            "Excellent job recognizing the shapes and their properties!",
            "Well done identifying the shapes and their attributes!",
            "Fantastic job describing the properties of the shapes!",
            "Great work recognizing the angles and sides of the shapes!",
            "Wonderful job identifying the properties of the 2D and 3D shapes!"
        ],
         "context_set": ""
        },
        {"tag": "propertiesOfShapesNegative",
         "patterns": [
            "I'm not sure if my answer is correct",
            "I don't understand how to identify the properties of shapes",
            "I think I might have missed something in my answer",
            "I'm confused about what the question is asking",
            "I don't feel confident in my ability to recognise the properties of shapes",
            "I need more practice identifying the properties of shapes",
            "I'm struggling to remember all the different properties of shapes",
            "I think I need more help understanding the concept",
            "I'm finding it hard to distinguish between different properties of shapes",
            "I'm not sure how to apply what I know to this particular problem"
          ],
         "responses": [
            "It seems like you're having trouble identifying the properties of shapes.",
            "Remember to pay attention to the angles and sides of each shape.",
            "You might want to review the different types of shapes and their properties.",
            "It looks like you need more practice recognising the properties of shapes.",
            "Try to focus on the attributes that make each shape unique.",
            "It's important to pay attention to the details when identifying shapes.",
            "Keep working on recognising the properties of different shapes.",
            "Make sure to take your time and examine each shape carefully.",
            "Don't forget to review the key terms and definitions for different shapes and their properties.",
            "It's okay to make mistakes, just make sure to learn from them and keep practicing."
          ],
         "context_set": ""
        },
        {"tag": "positionAndDirectionPositive",
         "patterns": [
            "My shape is definitly pointing in the right direction",
            "My shape is definitly facing the right direction",
            "I am very confident about position and direction",
            "Position and direction is easy",
            "I'm getting good at working with position of shapes",
            "I'm getting good at working with direction of shapes",
            "Changing the direction of my shape is easy.",
            "Changing the position of my shape is easy.",
            "I know that my shape is in the right place for certain",
            "My shape is in the right place",
            "My shape is pretty much correct",
            "I think my shape is definitly in the correct position",
            "I feel very confident in identifying positions of shapes on a grid.",
            "I'm very good at telling the direction of shapes.",
            "I'm confident in knowing which way a shape is facing.",
            "I feel comfortable with the terms 'left', 'right', 'up', 'down' when describing the position of shapes.",
            "I understand the difference between clockwise and anticlockwise directions.",
            "I'm feeling confident in identifying the location of shapes in a given coordinate system."
          ],
         "responses": [
            "Well done! You correctly identified the position of the shape.",
            "Great job! You accurately described the direction of the shape.",
            "Fantastic! You have a good understanding of the position and direction of shapes.",
            "Excellent work! You confidently identified the position and direction of the shape.",
            "Keep it up! You are doing a great job at recognising the position and direction of shapes.",
            "Brilliant! You have a strong grasp of the concept of position and direction of shapes."
          ],
         "context_set": ""
        },
        {"tag": "positionAndDirectionNegative",
         "patterns": [
            "My shape is definitly not pointing in the right direction ",
            "I am not confident about position and direction",
            "Position and direction is hard",
            "I'm struggling to work with position of shapes",
            "I'm struggling to work with direction of shapes",
            "I don't know how to change the direction of my shape.",
            "My shape is not in the right place",
            "I think my shape is too far left",
            "I think my shape is not right enough",
            "I'm not sure if I'm pointing the right direction.",
            "I'm having trouble understanding how to describe the position of the shape.",
            "I don't understand how to use coordinates to show the position of the shape.",
            "I don't think I'm describing the position of the shape correctly.",
            "I'm having a hard time visualizing the shape's position.",
            "I don't know how to describe the shape's direction.",
            "I'm not sure if the shape is facing the right direction.",
            "I'm confused about how to use compass directions to describe the shape's position.",
            "I need more practice describing the position and direction of shapes.",
            "I'm having trouble understanding how to use positional language."
          ],
         "responses": [
            "You need to pay more attention to the direction of the shapes",
            "Try again, your shapes are not in the correct position",
            "Make sure you understand the concept before attempting the questions",
            "You need to work on your spatial awareness skills",
            "Remember to check the position and orientation of the shapes",
            "Pay closer attention to the instructions and diagrams",
            "Practice more to improve your understanding of positions and directions",
            "Take your time and think carefully about the position and orientation of the shapes",
            "You need to work on your precision when placing the shapes",
            "Be more mindful of the position and orientation of the shapes",
            "Remember to use appropriate vocabulary to describe the positions and directions of the shapes",
            "Try to visualize the positions and directions in your mind before placing the shapes",
            "Pay attention to the reference points and axes used in the questions",
            "You need to develop your spatial reasoning skills to better recognize positions and directions of shapes",
            "Make sure to double-check your work for accuracy in position and direction of the shapes"
          ],
         "context_set": ""
        },
        {"tag": "statisticsPositive",
         "patterns": [
            "I am the master of statistics. Especially with statistical analysis",
            "Statistics are quite easy",
            "I feel much more comfortable with statistics",
            "I feel really confident with my data interpretation skills!",
            "I am pretty sure I got this one right because I used the right data set.",
            "I feel like I have a good understanding of what the data is telling us.",
            "I'm feeling good about my statistical analysis.",
            "I'm really enjoying learning about statistics and feel confident with my progress.",
            "I think I understand how to calculate the mean and median now!",
            "I feel like I have a good grasp on what a range is.",
            "I am feeling more comfortable with graphing and charting.",
            "I am confident in my ability to identify the mode.",
            "I feel good about my ability to make predictions based on data.",
            "I'm not sure if my data is normally distributed or not.",
            "I'm struggling with understanding the concept of standard deviation"
          ],
         "responses": [
            "Well done! You have identified the range of the data correctly.",
            "Great job! You have found the mode of the data set.",
            "Excellent work! You have calculated the mean of the data accurately.",
            "Amazing effort! You have correctly interpreted the data.",
            "Fantastic job! You have made a clear and accurate graph of the data.",
            "Good work! You have shown a good understanding of the measures of central tendency.",
            "Terrific job! You have correctly identified the outliers in the data set.",
            "Great effort! You have shown a good understanding of the different types of graphs.",
            "Impressive work! You have applied your knowledge of statistics to a real-life situation.",
            "Brilliant work! You have correctly interpreted the data and drawn appropriate conclusions."
          ],
         "context_set": ""
        },
        {"tag": "statisticsNegative",
         "patterns": [
            "I need to spend more time with statistics",
            "I am struggling with statistics",
            "Statistics is really hard for me to understand",
            "I'm not sure if I calculated the range correctly.",
            "I don't think I understand how to find the mode.",
            "I don't feel confident with this topic.",
            "I think I made a mistake in my calculation.",
            "I'm having trouble understanding the concept.",
            "I'm not sure if I'm using the right formula.",
            "I don't feel like I fully understand the instructions.",
            "I'm not confident with my answer.",
            "I'm struggling with this topic.",
            "I don't think I'm using the right method to solve this problem.",
            "I don't know how to apply the central limit theorem to this problem",
            "I'm having a hard time visualizing the distribution of this data",
            "I'm not sure if my hypothesis test is valid or not",
            "I'm confused about the difference between correlation and causation",
            "I'm having difficulty interpreting the results of my regression analysis",
            "I'm not confident with my ability to use Bayesian statistics",
            "I'm struggling with understanding the difference between Type I and Type II errors",
            "I'm not sure how to calculate confidence intervals",
            "I'm having trouble understanding the meaning of p-values"
          ],
         "responses": [
            "I think you need to review the range of your data",
            "Your calculation of mode is incorrect, please check again",
            "Your data seems incomplete, please check if you're missing any values",
            "Your graph is not labeled correctly, please make sure to include titles and units",
            "I think you should double-check your calculations for the mean",
            "Your chart is not a suitable representation of the data, please try a different type of graph",
            "You have outliers in your data, please consider removing them or using a different measure of central tendency",
            "Your data has inconsistencies, please check for any errors or mistakes",
            "Your interpretation of the data is not accurate, please reconsider your conclusions",
            "Your sample size may not be large enough for a valid conclusion, please consider collecting more data"
          ],
         "context_set": ""
        },
        {"tag": "algebraPositive",
         "patterns": [
            "I feel good about solving these equations!",
            "I know what to do to solve these problems!",
            "I am confident in my ability to find the value of the unknown!",
            "I understand how to use the formulas!",
            "I feel great about using algebra to solve problems!",
            "I am proud of my progress in algebra!",
            "I'm confident in my ability to solve these equations!",
            "I feel comfortable with these types of problems!",
            "I know how to use the rules of algebra to solve equations!",
            "I am able to solve these problems on my own!",
            "I feel confident in my algebraic thinking!",
            "I can see the patterns and relationships in these equations!"
          ],
         "responses": [
            "Well done, you've used the correct variables!",
            "Excellent work, you've solved the equation correctly!",
            "Great job, you've found the missing value!",
            "Fantastic effort, you've shown good understanding of algebra!",
            "Good work, you've simplified the expression perfectly!",
            "Superb, you've successfully solved for the unknown variable!",
            "Amazing, you've applied algebraic rules effectively!",
            "Brilliant work, you've shown real confidence in using algebra!",
            "Impressive, you've demonstrated good problem-solving skills with algebra!",
            "Terrific, you've shown great progress in using algebraic expressions!"
          ],
         "context_set": ""
        },
        {"tag": "algebraNegative",
         "patterns": [
            "I'm not comfortable with algebra",
            "I don't feel confident with my solution",
            "I don't understand the meaning of the variables",
            "I don't know what formula to use",
            "I'm finding it hard to keep track of the variables",
            "I don't know how to simplify the expressions",
            "I'm not sure how to check my answer",
            "I'm having difficulty with word problems",
            "I need assistance with algebraic expressions",
            "I don't know how to solve systems of equations",
            "Algebra isn't really my strong point",
            "I'm really struggling with algebra"
          ],
         "responses": [
            "You need to practice more to understand this concept",
            "Your answer is incorrect, please try again",
            "It seems like you didn't understand the question",
            "You need to work harder to improve your algebra skills",
            "You're making careless mistakes, please pay more attention",
            "Let's go over this concept again to help you understand it better",
            "Please check your work for errors",
            "I can see you're struggling, let's work together to solve this problem",
            "Don't be discouraged, algebra can be challenging but with practice you will get better",
            "Try to break down the problem into smaller steps and take your time to solve each one"
          ],
         "context_set": ""
        }
    ]
}